Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [3]:
S=pd.Series([ 4, 8, 15, 16, 23,42])    #creating series

In [6]:
type(S)      #confirming it is series by cheking type

pandas.core.series.Series

In [7]:
#printing the series
S

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
'''Ans(2)'''

my_list = [1, 2, 3, 4, 5, 6, 7, 'rht','rohit','rahul']

# Create a pandas Series from the list
my_series = pd.Series(my_list)

# Print the Series
print(my_series)

0        1
1        2
2        3
3        4
4        5
5        6
6        7
7      rht
8    rohit
9    rahul
dtype: object

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:
    Name       Age     Gender
    Alice      25      Female
    Bob        30      Male
    Claire     27      Female
    
Then, print the DataFrame.

In [10]:
'''Ans(3)'''
df=pd.DataFrame({'Name':['Alice','Bob','Claire'],
                 'Age':[25,30,27],
                 'Gender':['Female','Male','Female']
                })

In [11]:
df   #printing the  output

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans(4):
In pandas, both DataFrame and Series are fundamental data structures that are used for handling and analyzing data. They are part of the pandas library, which provides powerful tools for data manipulation and analysis in Python. 

1. Series:
A Series is a one-dimensional labeled array that can hold data of any type (integers, strings, floats, etc.). It's essentially a column of data with associated labels, known as the index. The index helps in identifying and accessing the elements in the Series. Each element in a Series corresponds to a single value.

2. DataFrame:
A DataFrame is a two-dimensional labeled data structure with columns that can hold different types of data. It's like a table in a relational database or an Excel spreadsheet. A DataFrame consists of multiple Series, where each Series represents a column. The columns in a DataFrame can be of different data types, and each column is identified by its column name. Additionally, DataFrames also have an index, similar to Series.

The main differences between Series and DataFrame are:

Dimensionality: A Series is a one-dimensional data structure, while a DataFrame is a two-dimensional data structure.

Columns: A Series contains a single column of data, while a DataFrame can have multiple columns.

Data structure: A Series is essentially a single column with an index, while a DataFrame is a collection of multiple columns (Series) with both row and column indexes.

In summary, while both Series and DataFrames are fundamental to pandas, DataFrames provide a more structured and versatile way of organizing and analyzing data, especially when dealing with multi-dimensional datasets.

In [12]:
'''Example for Series'''
s=pd.Series(['rohit','sandeep','rohan','Hemant'])
s

0      rohit
1    sandeep
2      rohan
3     Hemant
dtype: object

In [13]:
'''Example for DaraFrame'''
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22]}

df1 = pd.DataFrame(data)

print(df1)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans-Pandas offers a wide range of functions to manipulate data in a DataFrame. Here are some common functions you can use:

In [2]:
'''1.Filtering Data:

df[df['column_name'] > value]:   Filters rows based on a condition.
df.query('condition'):       Filters rows using a query expression.

Example:'''

import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22]}
df = pd.DataFrame(data)

result = df[df['Age'] > 25]

In [3]:
result

  Name  Age
1  Bob   30

In [4]:
'''2.Selecting Columns:

df['column_name']: Selects a single column as a Series.
df[['col1', 'col2']]: Selects multiple columns as a DataFrame.

Example:'''

names = df['Name']
subset = df[['Name', 'Age']]

In [5]:
'''3.Sorting Data:

df.sort_values('column_name'): Sorts the DataFrame by a specified column.
df.sort_values(['col1', 'col2']): Sorts by multiple columns.

Example:'''

sorted_df = df.sort_values('Age')

In [6]:
sorted_df

      Name  Age
2  Charlie   22
0    Alice   25
1      Bob   30

In [13]:
'''4.Applying Functions:

df['new_column'] = df['column'].apply(function): Applies a function to a column and creates a new column.

Example:'''

df['Age_Group'] = df['Age'].apply(lambda age: 'Young' if age < 30 else 'Old')

In [14]:
df

      Name  Age Age_Group
0    Alice   25     Young
1      Bob   30       Old
2  Charlie   22     Young

In [15]:
'''5.Missing Data Handling:

df.dropna(): Removes rows with missing values.
df.fillna(value): Fills missing values with a specified value.

Example:'''

df_cleaned = df.dropna()

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Ans-Among the above, the DataFrame is mutable in nature.

In Python, mutability refers to whether an object's state can be modified after it is created. A mutable object can be changed, while an immutable object cannot. Here's the breakdown for the options you mentioned:

Series: A Series in pandas is mutable. we can modify its values, add new values, or remove existing values.

DataFrame: A DataFrame in pandas is mutable. You can add or remove columns, change values, and perform various operations that modify its structure and content.

Panel: The Panel was a three-dimensional data structure in older versions of pandas (before version 0.25). However, as of version 0.25, the Panel has been deprecated and is no longer a primary data structure in pandas. Instead, we're encouraged to use MultiIndex DataFrames for similar use cases. Since it's no longer a primary data structure, discussing its mutability is not applicable in the context of modern pandas usage.

In summary, both Series and DataFrames in pandas are mutable, meaning we can modify their contents and structure after they are created

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [26]:
'''Example for Question(7)'''
Name=pd.Series(['rohit','rohan','rht','mohan','sohan','sandeep'])
Age=pd.Series([20,21,23,25,26,24])
Scores=pd.Series([91,89,84,81,80,90])

df2=pd.DataFrame({'Name':Name,'Age':Age,'Scores':Scores})

In [27]:
df2

      Name  Age  Scores
0    rohit   20      91
1    rohan   21      89
2      rht   23      84
3    mohan   25      81
4    sohan   26      80
5  sandeep   24      90